#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.azurerm_client_config.current: Reading...
module.shared.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lYWI4ODQ2ZS1lNTE1LTRhMWYtODdmZi1kM2U3YzgxYTg4ZTk7b2JqZWN0SWQ9NmYxYjYwY2EtNTM2Mi00ZjA2LWJjOTAtMGFiNGJiMTc4ZjhhO3N1YnNjcmlwdGlvbklkPTg2NGViOWQwLWU5YzQtNGQ2Yi1iZjExLWJkNGNmZGUwNWU4MTt0ZW5hbnRJZD00NDlmYmUxZC05Yzk5LTQ1MDktOTAxNC00ZmQ1Y2YyNWIwMTQ=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apim.azurerm_api_management.apim_internal will be created
  + resource "azurerm_api_management" "apim_internal" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + management_api_url            = (known after apply)
      + name                          = "apim-lza-prod-eastus-001"
      + notification_sender_email     = (known after apply)
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "apim@contoso.com"
      + publisher_name                = "Contoso"
      + resource_group_name           = "rg-apim-lza-prod-eastus-001"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + virtual_network_type          = "Internal"

      + hostname_configuration {
          + developer_portal {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + certificate_source              = (known after apply)
              + certificate_status              = (known after apply)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + management {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + certificate_source              = (known after apply)
              + certificate_status              = (known after apply)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + portal {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + certificate_source              = (known after apply)
              + certificate_status              = (known after apply)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + proxy {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + certificate_source              = (known after apply)
              + certificate_status              = (known after apply)
              + default_ssl_binding             = (known after apply)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }

          + scm {
              + certificate                     = (sensitive value)
              + certificate_password            = (sensitive value)
              + certificate_source              = (known after apply)
              + certificate_status              = (known after apply)
              + expiry                          = (known after apply)
              + host_name                       = (known after apply)
              + key_vault_id                    = (known after apply)
              + negotiate_client_certificate    = (known after apply)
              + ssl_keyvault_identity_client_id = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols {
          + enable_http2 = (known after apply)
        }

      + security {
          + enable_backend_ssl30                                = (known after apply)
          + enable_backend_tls10                                = (known after apply)
          + enable_backend_tls11                                = (known after apply)
          + enable_frontend_ssl30                               = (known after apply)
          + enable_frontend_tls10                               = (known after apply)
          + enable_frontend_tls11                               = (known after apply)
          + tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = (known after apply)
          + tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = (known after apply)
          + tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = (known after apply)
          + tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = (known after apply)
          + tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = (known after apply)
          + tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = (known after apply)
          + triple_des_ciphers_enabled                          = (known after apply)
        }

      + sign_in {
          + enabled = (known after apply)
        }

      + sign_up {
          + enabled = (known after apply)

          + terms_of_service {
              + consent_required = (known after apply)
              + enabled          = (known after apply)
              + text             = (known after apply)
            }
        }

      + tenant_access {
          + enabled       = (known after apply)
          + primary_key   = (sensitive value)
          + secondary_key = (sensitive value)
          + tenant_id     = (known after apply)
        }

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.apim.azurerm_api_management_diagnostic.apim_diagnostic will be created
  + resource "azurerm_api_management_diagnostic" "apim_diagnostic" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "apim-lza-prod-eastus-001"
      + http_correlation_protocol = (known after apply)
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = (known after apply)
      + operation_name_format     = "Name"
      + resource_group_name       = "rg-apim-lza-prod-eastus-001"
      + sampling_percentage       = 100
      + verbosity                 = "verbose"

      + backend_request {
          + body_bytes     = 32
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + backend_response {
          + body_bytes     = 32
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_request {
          + body_bytes     = 32
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 32
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }
    }

  # module.apim.azurerm_api_management_logger.apim_logger will be created
  + resource "azurerm_api_management_logger" "apim_logger" {
      + api_management_name = "apim-lza-prod-eastus-001"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "apim-logger"
      + resource_group_name = "rg-apim-lza-prod-eastus-001"
      + resource_id         = (known after apply)

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.apim.azurerm_resource_group.apim_internal_rg will be created
  + resource "azurerm_resource_group" "apim_internal_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-apim-lza-prod-eastus-001"
    }

  # module.application_gateway.azurerm_application_gateway.network will be created
  + resource "azurerm_application_gateway" "network" {
      + enable_http2                = true
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "appgw-001"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rg-apim-lza-prod-eastus-001"

      + autoscale_configuration {
          + max_capacity = 3
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = [
              + "apim-lza-prod-eastus-001.azure-api.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "apim"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "apim-lza-prod-eastus-001.azure-api.net"
          + id                                  = (known after apply)
          + name                                = "https"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "APIM"
          + protocol                            = "Https"
          + request_timeout                     = 20
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + affinity_cookie_name                = "ApplicationGatewayAffinity"
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 20
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "port_443"
          + port = 443
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "port_80"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "appGatewayIpConfig"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "port_443"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "https"
          + protocol                       = "Https"
          + require_sni                    = false
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "api.contoso.com"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "port_80"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "default"
          + protocol                       = "Http"
          + require_sni                    = false
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "apim-lza-prod-eastus-001.azure-api.net"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "APIM"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "apim"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "https"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "https"
          + id                         = (known after apply)
          + name                       = "apim"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = (known after apply)
          + name                = "api.contoso.com"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.0"
        }
    }

  # module.application_gateway.azurerm_key_vault_access_policy.user_assigned_identity_keyvault_permissions will be created
  + resource "azurerm_key_vault_access_policy" "user_assigned_identity_keyvault_permissions" {
      + certificate_permissions = [
          + "Import",
          + "Get",
          + "List",
          + "Update",
          + "Create",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = (known after apply)
    }

  # module.application_gateway.azurerm_key_vault_certificate.local_domain_certs[0] will be created
  + resource "azurerm_key_vault_certificate" "local_domain_certs" {
      + certificate_attribute   = (known after apply)
      + certificate_data        = (known after apply)
      + certificate_data_base64 = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "generated-cert"
      + secret_id               = (known after apply)
      + thumbprint              = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + versionless_secret_id   = (known after apply)

      + certificate_policy {
          + issuer_parameters {
              + name = "Self"
            }

          + key_properties {
              + curve      = (known after apply)
              + exportable = true
              + key_size   = 2048
              + key_type   = "RSA"
              + reuse_key  = true
            }

          + lifetime_action {
              + action {
                  + action_type = "AutoRenew"
                }

              + trigger {
                  + days_before_expiry = 30
                }
            }

          + secret_properties {
              + content_type = "application/x-pkcs12"
            }

          + x509_certificate_properties {
              + extended_key_usage = [
                  + "1.3.6.1.5.5.7.3.1",
                ]
              + key_usage          = [
                  + "digitalSignature",
                  + "keyEncipherment",
                ]
              + subject            = "CN=api.contoso.com"
              + validity_in_months = 12

              + subject_alternative_names {
                  + dns_names = (known after apply)
                  + emails    = (known after apply)
                  + upns      = (known after apply)
                }
            }
        }
    }

  # module.application_gateway.azurerm_public_ip.public_ip will be created
  + resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-appgw-001"
      + resource_group_name     = "rg-apim-lza-prod-eastus-001"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.application_gateway.azurerm_user_assigned_identity.user_assigned_identity will be created
  + resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "identity-appgw-001"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-apim-lza-prod-eastus-001"
      + tenant_id           = (known after apply)
    }

  # module.backend.azurerm_linux_function_app.function_app will be created
  + resource "azurerm_linux_function_app" "function_app" {
      + app_settings                      = {
          + "FUNCTIONS_WORKER_RUNTIME" = "dotnet"
          + "WEBSITE_RUN_FROM_PACKAGE" = ""
        }
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "func-code-lza-prod-eastus-001"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "rg-backend-lza-prod-eastus-001"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "stbackendlzaeastus"
      + storage_uses_managed_identity     = false

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = [
              + {
                  + action                    = "Allow"
                  + headers                   = null
                  + ip_address                = null
                  + name                      = (known after apply)
                  + priority                  = 65000
                  + service_tag               = null
                  + virtual_network_subnet_id = (known after apply)
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version              = "3.1"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.backend.azurerm_linux_function_app.function_app_container will be created
  + resource "azurerm_linux_function_app" "function_app_container" {
      + app_settings                      = {
          + "FUNCTIONS_WORKER_RUNTIME" = "dotnet"
          + "WEBSITE_RUN_FROM_PACKAGE" = ""
        }
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "func-cont-lza-prod-eastus-001"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "rg-backend-lza-prod-eastus-001"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "stbackendlzaeastus"
      + storage_uses_managed_identity     = false

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = [
              + {
                  + action                    = "Allow"
                  + headers                   = null
                  + ip_address                = null
                  + name                      = (known after apply)
                  + priority                  = 65000
                  + service_tag               = null
                  + virtual_network_subnet_id = (known after apply)
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + use_dotnet_isolated_runtime = false

              + docker {
                  + image_name   = "azure-functions/dotnet"
                  + image_tag    = "latest"
                  + registry_url = "mcr.microsoft.com"
                }
            }
        }
    }

  # module.backend.azurerm_resource_group.backend_rg will be created
  + resource "azurerm_resource_group" "backend_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-backend-lza-prod-eastus-001"
    }

  # module.backend.azurerm_service_plan.function_app_service_plan will be created
  + resource "azurerm_service_plan" "function_app_service_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "asp-lza-prod-eastus-001"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-backend-lza-prod-eastus-001"
      + sku_name                     = "P1v2"
      + worker_count                 = (known after apply)
    }

  # module.backend.azurerm_storage_account.backend_storage_account will be created
  + resource "azurerm_storage_account" "backend_storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "stbackendlzaeastus"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-backend-lza-prod-eastus-001"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.networking.azurerm_bastion_host.bastion_host will be created
  + resource "azurerm_bastion_host" "bastion_host" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "bastion-lza-prod-eastus"
      + resource_group_name    = "rg-networking-lza-prod-eastus"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tags                   = {
          + "Owner" = "APIM Const Set"
        }
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "bastionipcfg-lza-prod-eastus"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.networking.azurerm_network_security_group.apim_snnsg_nsg will be created
  + resource "azurerm_network_security_group" "apim_snnsg_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-apim-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "AzureKeyVault"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "apim-azure-kv"
              + priority                                   = 2020
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "SQL"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "1443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "apim-azure-sql"
              + priority                                   = 2010
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "Storage"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "apim-azure-storage"
              + priority                                   = 2000
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowApimVnetInbound"
              + priority                                   = 2000
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "6390"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "apim-azure-infra-lb"
              + priority                                   = 2010
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # module.networking.azurerm_network_security_group.appgateway_nsg will be created
  + resource "azurerm_network_security_group" "appgateway_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-apgw-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAzureLoadBalancerInbound"
              + priority                                   = 121
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowTLSInbound"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "65200-65535"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHealthProbesInbound"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTPInbound"
              + priority                                   = 111
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # module.networking.azurerm_network_security_group.backend_snnsg_nsg will be created
  + resource "azurerm_network_security_group" "backend_snnsg_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-bcke-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = (known after apply)
    }

  # module.networking.azurerm_network_security_group.bastion_nsg will be created
  + resource "azurerm_network_security_group" "bastion_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-bast-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAzureLoadBalancerInbound"
              + priority                                   = 140
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowGatewayManagerInbound"
              + priority                                   = 130
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHttpsInbound"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "AzureCloud"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAzureCloudOutbound"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "Internet"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowGetSessionInformation"
              + priority                                   = 130
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                ]
              + direction                                  = "Outbound"
              + name                                       = "AllowSshRdpOutbound"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "5701",
                  + "8080",
                ]
              + direction                                  = "Inbound"
              + name                                       = "AllowBastionHostCommunicationInbound"
              + priority                                   = 150
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "5701",
                  + "8080",
                ]
              + direction                                  = "Outbound"
              + name                                       = "AllowBastionCommunication"
              + priority                                   = 120
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # module.networking.azurerm_network_security_group.devops_nsg will be created
  + resource "azurerm_network_security_group" "devops_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-devops-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = (known after apply)
    }

  # module.networking.azurerm_network_security_group.jumpbox_nsg will be created
  + resource "azurerm_network_security_group" "jumpbox_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-jbox-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = (known after apply)
    }

  # module.networking.azurerm_network_security_group.private_endpoint_snnsg_nsg will be created
  + resource "azurerm_network_security_group" "private_endpoint_snnsg_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-prep-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + security_rule       = (known after apply)
    }

  # module.networking.azurerm_public_ip.bastion_public_ip will be created
  + resource "azurerm_public_ip" "bastion_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-bastion-lza-prod-eastus"
      + resource_group_name     = "rg-networking-lza-prod-eastus"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.networking.azurerm_public_ip.public_ip will be created
  + resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Dynamic"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-apimcs-lza-prod-eastus"
      + resource_group_name     = "rg-networking-lza-prod-eastus"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
    }

  # module.networking.azurerm_resource_group.networking_resourece_group will be created
  + resource "azurerm_resource_group" "networking_resourece_group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-networking-lza-prod-eastus"
    }

  # module.networking.azurerm_virtual_network.apim_cs_vnet will be created
  + resource "azurerm_virtual_network" "apim_cs_vnet" {
      + address_space       = [
          + "10.2.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-apim-cs-lza-prod-eastus"
      + resource_group_name = "rg-networking-lza-prod-eastus"
      + subnet              = [
          + {
              + address_prefix = "10.2.1.0/24"
              + id             = (known after apply)
              + name           = "AzureBastionSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.2.2.0/24"
              + id             = (known after apply)
              + name           = "snet-devops-lza-prod-eastus"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.2.3.0/24"
              + id             = (known after apply)
              + name           = "snet-jbox-lza-prod-eastus-001"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.2.4.0/24"
              + id             = (known after apply)
              + name           = "snet-apgw-lza-prod-eastus-001"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.2.5.0/24"
              + id             = (known after apply)
              + name           = "snet-prep-lza-prod-eastus-001"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.2.6.0/24"
              + id             = (known after apply)
              + name           = "snet-bcke-lza-prod-eastus-001"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.2.7.0/24"
              + id             = (known after apply)
              + name           = "snet-apim-lza-prod-eastus-001"
              + security_group = (known after apply)
            },
        ]
      + tags                = {
          + "Owner" = "APIM Const Set"
        }
    }

  # module.shared.azurerm_application_insights.shared_apim_insight will be created
  + resource "azurerm_application_insights" "shared_apim_insight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "appi-lza-prod-eastus-001"
      + resource_group_name                   = "rg-shared-lza-prod-eastus-001"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.shared.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "kv-lza-prod-eastus-001"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-shared-lza-prod-eastus-001"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "449fbe1d-9c99-4509-9014-4fd5cf25b014"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.shared.azurerm_key_vault_access_policy.deployment_spn_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "deployment_spn_access_policy" {
      + certificate_permissions = [
          + "Import",
          + "Get",
          + "List",
          + "Update",
          + "Create",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "6f1b60ca-5362-4f06-bc90-0ab4bb178f8a"
      + secret_permissions      = [
          + "Get",
        ]
      + storage_permissions     = [
          + "Get",
        ]
      + tenant_id               = "449fbe1d-9c99-4509-9014-4fd5cf25b014"
    }

  # module.shared.azurerm_log_analytics_workspace.log_analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics_workspace" {
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + location                           = "eastus"
      + name                               = "log-lza-prod-eastus-001"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "rg-shared-lza-prod-eastus-001"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # module.shared.azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "jumpbox-prod-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-shared-lza-prod-eastus-001"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.shared.azurerm_private_dns_a_record.dev_portal_record will be created
  + resource "azurerm_private_dns_a_record" "dev_portal_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "portal"
      + records             = (known after apply)
      + resource_group_name = "rg-shared-lza-prod-eastus-001"
      + ttl                 = 300
      + zone_name           = "portal.azure-api.net"
    }

  # module.shared.azurerm_private_dns_a_record.gateway_record will be created
  + resource "azurerm_private_dns_a_record" "gateway_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apim-lza-prod-eastus-001"
      + records             = (known after apply)
      + resource_group_name = "rg-shared-lza-prod-eastus-001"
      + ttl                 = 36000
      + zone_name           = "azure-api.net"
    }

  # module.shared.azurerm_private_dns_a_record.mgmt_portal_record will be created
  + resource "azurerm_private_dns_a_record" "mgmt_portal_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "management"
      + records             = (known after apply)
      + resource_group_name = "rg-shared-lza-prod-eastus-001"
      + ttl                 = 300
      + zone_name           = "management.azure-api.net"
    }

  # module.shared.azurerm_private_dns_a_record.new_dev_portal_record will be created
  + resource "azurerm_private_dns_a_record" "new_dev_portal_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "developer"
      + records             = (known after apply)
      + resource_group_name = "rg-shared-lza-prod-eastus-001"
      + ttl                 = 300
      + zone_name           = "developer.azure-api.net"
    }

  # module.shared.azurerm_private_dns_a_record.scm_record will be created
  + resource "azurerm_private_dns_a_record" "scm_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "scm"
      + records             = (known after apply)
      + resource_group_name = "rg-shared-lza-prod-eastus-001"
      + ttl                 = 300
      + zone_name           = "scm.azure-api.net"
    }

  # module.shared.azurerm_private_dns_zone.dev_portal will be created
  + resource "azurerm_private_dns_zone" "dev_portal" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "portal.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-shared-lza-prod-eastus-001"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.shared.azurerm_private_dns_zone.gateway will be created
  + resource "azurerm_private_dns_zone" "gateway" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-shared-lza-prod-eastus-001"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.shared.azurerm_private_dns_zone.mgmt_portal will be created
  + resource "azurerm_private_dns_zone" "mgmt_portal" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "management.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-shared-lza-prod-eastus-001"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.shared.azurerm_private_dns_zone.new_dev_portal will be created
  + resource "azurerm_private_dns_zone" "new_dev_portal" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "developer.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-shared-lza-prod-eastus-001"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.shared.azurerm_private_dns_zone.scm will be created
  + resource "azurerm_private_dns_zone" "scm" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "scm.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-shared-lza-prod-eastus-001"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.shared.azurerm_private_dns_zone_virtual_network_link.dev_portal_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dev_portal_vnetlink" {
      + id                    = (known after apply)
      + name                  = "portal-vnet-link"
      + private_dns_zone_name = "portal.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-shared-lza-prod-eastus-001"
      + virtual_network_id    = (known after apply)
    }

  # module.shared.azurerm_private_dns_zone_virtual_network_link.gateway_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "gateway_vnetlink" {
      + id                    = (known after apply)
      + name                  = "gateway-vnet-link"
      + private_dns_zone_name = "azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-shared-lza-prod-eastus-001"
      + virtual_network_id    = (known after apply)
    }

  # module.shared.azurerm_private_dns_zone_virtual_network_link.mgmt_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "mgmt_vnetlink" {
      + id                    = (known after apply)
      + name                  = "mgmt-vnet-link"
      + private_dns_zone_name = "management.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-shared-lza-prod-eastus-001"
      + virtual_network_id    = (known after apply)
    }

  # module.shared.azurerm_private_dns_zone_virtual_network_link.new_dev_portal_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "new_dev_portal_vnetlink" {
      + id                    = (known after apply)
      + name                  = "dev-portal-vnet-link"
      + private_dns_zone_name = "developer.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-shared-lza-prod-eastus-001"
      + virtual_network_id    = (known after apply)
    }

  # module.shared.azurerm_private_dns_zone_virtual_network_link.scm_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "scm_vnetlink" {
      + id                    = (known after apply)
      + name                  = "scm-vnet-link"
      + private_dns_zone_name = "scm.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-shared-lza-prod-eastus-001"
      + virtual_network_id    = (known after apply)
    }

  # module.shared.azurerm_resource_group.shared_rg will be created
  + resource "azurerm_resource_group" "shared_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-shared-lza-prod-eastus-001"
    }

  # module.shared.azurerm_virtual_machine_extension.deploy_agent[0] will be created
  + resource "azurerm_virtual_machine_extension" "deploy_agent" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "devops_agent"
      + publisher                   = "Microsoft.Compute"
      + settings                    = (sensitive)
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.10"
      + virtual_machine_id          = (known after apply)
    }

  # module.shared.azurerm_windows_virtual_machine.agent_vm will be created
  + resource "azurerm_windows_virtual_machine" "agent_vm" {
      + admin_password             = (sensitive value)
      + admin_username             = "apimlzademo"
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = false
      + id                         = (known after apply)
      + location                   = "eastus"
      + max_bid_price              = -1
      + name                       = "jumpbox-prod"
      + network_interface_ids      = (known after apply)
      + patch_assessment_mode      = "ImageDefault"
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "rg-shared-lza-prod-eastus-001"
      + size                       = "Standard_F2"
      + virtual_machine_id         = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

Plan: 49 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: //home/runner/work/_temp/appgw-iapim-func.47.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "//home/runner/work/_temp/appgw-iapim-func.47.tfplan"

```

</details>

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `reference-implementations/AppGW-IAPIM-Func/terraform`, Workflow: `Terraform ES-APIM Deploy`*